app/views/ratings/index.html.erb

        <td><%= b.favorite_brewery.name %></td>
        <td><%= b.ratings.count %></td>
---
SELECT "ratings".* FROM "ratings"
SELECT COUNT(*) FROM "ratings"