app/views/beers/show.html.erb

SELECT  1 AS one FROM "ratings" WHERE "ratings"."beer_id" = ? LIMIT 1  [["beer_id", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]
---
</p>
<% if @beer.ratings.empty? %>