app/controllers/beers_controller.rb

  def index
    @beers = Beer.includes(:brewery, :style).all
---
SELECT "beers".* FROM "beers"

  def edit
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def create
    expire_fragment('beerlist')
	["beerlist-name", "beerlist-brewery", "beerlist-style"].each{ |f| expire_fragment(f) }
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("name", "style_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Karhu"], ["style_id", 1], ["created_at", "2015-03-01 11:57:19.851174"], ["updated_at", "2015-03-01 11:57:19.851174"]]

    def set_breweries_and_styles_for_template
      @breweries = Brewery.all
      @styles = Style.all
---
SELECT "breweries".* FROM "breweries"
SELECT "styles".* FROM "styles"