app/controllers/beer_clubs_controller.rb

SELECT "beer_clubs".* FROM "beer_clubs"
---
  def index
    @beer_clubs = BeerClub.all

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."beer_club_id" = ? AND "memberships"."user_id" = ? LIMIT 1  [["beer_club_id", 1], ["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."beer_club_id" = ? AND "users"."id" = ?  [["beer_club_id", 1], ["id", 1]]
---
  def show
    if @beer_club.members.include? current_user
      @membership = @beer_club.memberships.find_by user_id:current_user.id

INSERT INTO "beer_clubs" ("name", "founded", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "cluba"], ["founded", 1999], ["city", "Here"], ["created_at", "2015-02-21 11:54:27.887303"], ["updated_at", "2015-02-21 11:54:27.887303"]]
---
  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save

SELECT  "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_beer_club
      @beer_club = BeerClub.find(params[:id])