app/controllers/breweries_controller.rb

  def toggle_activity
    brewery = Brewery.find(params[:id])
    brewery.update_attribute :active, (not brewery.active)
---
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "breweries" SET "active" = ?, "updated_at" = ? WHERE "breweries"."id" = ?  [["active", "f"], ["updated_at", "2015-02-22 13:12:12.814952"], ["id", 1]]