app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships"
---
  def index
    @memberships = Membership.all

INSERT INTO "memberships" ("beer_club_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["user_id", 1], ["created_at", "2015-02-21 11:54:32.675728"], ["updated_at", "2015-02-21 11:54:32.675728"]]
---
  def create
    @membership = Membership.new(membership_params)
    @membership.user = current_user
	@membership.confirmed = false

    respond_to do |format|
      if @membership.save