app/controllers/ratings_controller.rb

  def index

	Rails.cache.write("beer top 3", Beer.top(3)) if cache_does_not_contain_data_or_it_is_too_old("beer top 3")
    @best_beers = Rails.cache.read "beer top 3"

	Rails.cache.write("ratings", Rating.all) if cache_does_not_contain_data_or_it_is_too_old("ratings")
---
SELECT "beers".* FROM "beers"
SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]

  def new
    @rating = Rating.new
    @beers = Beer.all
---
SELECT "beers".* FROM "beers"

  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if current_user.nil?
      redirect_to signin_path, notice:'you should be signed in'
    elsif @rating.save
      current_user.ratings << @rating  ## virheen aiheuttanut rivi
      redirect_to user_path current_user
    else
      @beers = Beer.all
---
INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 2], ["beer_id", 1], ["created_at", "2015-02-21 11:49:24.898678"], ["updated_at", "2015-02-21 11:49:24.898678"]]
SELECT "beers".* FROM "beers"

  def destroy
    rating = Rating.find(params[:id])
    rating.delete if current_user == rating.user
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 2]]