app/controllers/styles_controller.rb

SELECT "styles".* FROM "styles"
---
  def index
    @styles = Style.all

DELETE FROM "styles" WHERE "styles"."id" = ?  [["id", 3]]
---
  def destroy
    @style.destroy

SELECT  "styles".* FROM "styles" WHERE "styles"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_style
      @style = Style.find(params[:id])