app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "account_frozen" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["account_frozen", "t"], ["updated_at", "2015-02-22 13:48:59.243469"], ["id", 2]]
---
  def freeze_account
	user = User.find(params[:id])
	user.update_attribute :account_frozen, (not user.account_frozen)

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save